ext_alsav/InformationRegisters/алсав_КлючиСекретов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсав_КлючиСекретов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_КлючиСекретов/Forms/ФормаУправленияСекретами/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗначениеСекретаСкрыто;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеСекретаСкрыто = Истина;
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	СписокСекретов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алсав_КлючиСекретов.Ключ КАК Ключ,
		|	алсав_КлючиСекретов.Используется КАК Используется
		|ИЗ
		|	РегистрСведений.алсав_КлючиСекретов КАК алсав_КлючиСекретов
		|ГДЕ
		|	алсав_КлючиСекретов.Активность = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ключ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокСекретов.Добавить();
		НоваяСтрока.Ключ = Выборка.Ключ;
		НоваяСтрока.Используется = Выборка.Используется;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСекретовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКлюч = ВыбраннаяСтрока.Ключ;
	Используется = ВыбраннаяСтрока.Используется;
	
	ЗагрузитьЗначениеСекрета();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСекретовПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКлюч = ТекущаяСтрока.Ключ;
	Используется = ТекущаяСтрока.Используется;
	
	ЗагрузитьЗначениеСекрета();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗначениеСекрета()
	
	Если ПустаяСтрока(ТекущийКлюч) Тогда
		ЗначениеСекрета = "";
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗначениеСекрета = алсав_ВыгрузкаCsvJson.ПолучитьСекрет(ТекущийКлюч);
		ЗначениеСекрета = ЗначениеСекрета;
	Исключение
		ЗначениеСекрета = "";
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСекретПриИзменении(Элемент)
	
	Если ПоказыватьСекрет Тогда
		ЗагрузитьЗначениеСекрета();
	Иначе
		ЗначениеСекрета = "******";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСекрет(Команда)
	
	Если ПустаяСтрока(ТекущийКлюч) Тогда
		ПоказатьПредупреждение(, "Необходимо указать ключ секрета!");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ЗначениеСекрета) Тогда
		ПоказатьПредупреждение(, "Необходимо указать значение секрета!");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьСекретЗавершение", ЭтотОбъект);
	НачатьТранзакцию();
	Попытка
		СохранитьСекретНаСервере(ТекущийКлюч, ЗначениеСекрета, Используется);
		ЗафиксироватьТранзакцию();
		ПоказатьОповещениеПользователя("Сохранение", , "Секрет '" + ТекущийКлюч + "' успешно сохранен!", БиблиотекаКартинок.Информация32);
		ОбновитьСписокНаСервере();
	Исключение
		ОтменитьТранзакцию();
		ПоказатьПредупреждение(, "Ошибка при сохранении секрета: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСекретНаСервере(Ключ, Значение, Используемый)
	
	НаборЗаписей = РегистрыСведений.алсав_КлючиСекретов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Ключ = Ключ;
	НоваяЗапись.Значение = Значение;
	НоваяЗапись.Используется = Используемый;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСекрет(Команда)
	
	Если ПустаяСтрока(ТекущийКлюч) Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать секрет для удаления!");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Удалить секрет '" + ТекущийКлюч + "'?";
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСекретПродолжение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСекретПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьСекретНаСервере(ТекущийКлюч);
		ПоказатьОповещениеПользователя("Удаление", , "Секрет '" + ТекущийКлюч + "' удален!", БиблиотекаКартинок.Информация32);
		
		ТекущийКлюч = "";
		ЗначениеСекрета = "";
		Используется = Ложь;
		
		ОбновитьСписокНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСекретНаСервере(Ключ)
	
	НаборЗаписей = РегистрыСведений.алсав_КлючиСекретов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	НаборЗаписей.Записать();
	
КонецПроцедуры
